[{"pageContent":"English | བོད་ཡིག Atiśa DīpaṃkaraCourtesy of Himalayan Art Resourcesby Atiśa DīpaṃkaraWhen Lord Atiśa first went to Ngari, he stayed for two years and, while there, granted a wealth of teachings to Lha Changchub Ö and others. He then thought to return to India, and as he prepared to depart, Lha Changchup Ö requested him to give a final piece of advice. Lord Atiśa replied that what he had taught in the past was enough, but Lha insisted, pleading with him, and so Lord Atiśa imparted these words of advice.How wondrous! Dear friends of high knowledge and pure, noble intent, Though I, a trifling and unintelligent man, am unfit to give you advice, Precious supreme friends, more dear than my heart itself, you entreat me thus, And so I, this foolish little man, offer these thoughts to your noble minds. Friends, until you reach awakening you need a guru, so follow a sublime spiritual friend. Until you realize the natural state you need to receive teachings, so listen to the guru’s instructions. You won’t become buddhas through mere knowledge of the Dharma. Knowledge is not enough; you must practice! Avoid places that disturb your mind, and always stay in places that enhance virtue. Until you gain stability, hustle and bustle is detrimental, so hold fast to isolated forest retreats. Avoid companions who stir up the afflictions; keep company with those who encourage virtue, and cherish them. Work and tasks will never end, so put projects aside and be still. Dedicate all your virtue, day and night, and keep constant guard over your mind. It is a pith instruction to follow the words of the guru, so do whatever he tells you, be it meditation or anything else. Apply yourself to the guru’s instructions with great devotion, and before long results will emerge on their own. If you practice Dharma wholeheartedly, food and clothing will always find you – that’s how it goes. Dear friends, be content, for desire is like salt water; drinking it only makes you thirst for more. Do away with conceit, arrogance, pretense, and pride, and make yourselves humble and tamed. So-called meritorious busyness is an obstacle for Dharma practice, so give it up. Honor and gain are the traps of Māra, so cast them away like stones from a weighing scale. Words of praise and fame will lead you astray, so toss them aside like revolting lumps of snot. Comfort, joy, and caring friends – you might have them all now, but they’ll fade soon enough, so leave them behind. Your future lives are much longer than this one, so prepare your provisions for the future and bury your treasure now! All is lost in the end, so strive not and cling to naught. Arouse compassion for the needy and never ignore them, nor treat them with disdain. Rid yourself of bias and prejudice toward enemies and rival clans. Do not envy those with talent and learning; rouse respect, and learn from them. Look not at others’ faults but at your own, and rid yourself of them as you would infected blood. Think not of your own but of others’ virtue, and treat everyone with respect, as a servant would. Regard all beings as your parents, and care for them with the love of a child. Keep a smile on your face and love in your heart, and speak frankly, free from anger. Irrelevant chatter will lead to confusion, so speak in a measured, appropriate way. Pointless activity will interrupt your spiritual practice, so set aside all deeds that are not Dharma. Don’t exert yourself in meaningless work; such efforts will only tire you out. Due to karma and external circumstances you may not accomplish what you have set out to do. Thus it is better to relax and let be, and you will be happy and at ease. Displeasing a noble being is as grave as death itself; thus don’t do things that you will regret but be a trustworthy and honest person. The pleasure and pain of this life stem from your own past karma, so don’t lay blame elsewhere. All happiness is the guru’s blessing, so strive to repay his kindness and grace. Until you tame your own mind, you cannot tame others’, so first tame yourself. If you lack clairvoyance you can’t ripen others, so exert yourself in practice. When you die, all your wealth is sure to be left behind, so don’t go amassing sins for the sake of wealth. It is futile to lose yourself to luxury and wealth. Instead, adorn yourself with the glory of giving. It will bring beauty in this life and bliss in the next, so maintain a pure and constant discipline. In these degenerate times aggression is on the rise, so don the armor of patience, free from aggression. It is our laziness that keeps us here, so rekindle your efforts in practice like a blazing pyre. Our lives run out in constant distraction, so now let us train in meditation. Swayed by wrong views, we fail to realize the natural state, so let us examine the genuine nature of things. Dear friends, here in the swamp of saṃsāra there is no happiness, so let us journey to the dry shore of liberation. Train correctly in the guru’s instructions; dry up the ocean of saṃsāra’s suffering. Take these words to heart: they are spoken sincerely and so are worthy of attention. If you do so, you will bring joy to me, and happiness to yourself and others too. I humbly request you to take heed of these instructions that I, this foolish man, have given. Thus Lord Atiśa spoke to the venerable Changchub Ö. Whatever wholesome virtue is created by this, I dedicate it to the fulfillment of all the aspirations made By the sugatas of the three times, and their heirs, And as a cause for upholding the sacred Dharma of scripture and realization! Sarva maṅgalam![1] | Samye Translations, December 2020 (trans. Laura Dainty and Maitri Yarnell, ed. Libby Hogg). First published on Lotsawa House, 2021.Atiśa. \"mnyam med jo bo chen po rgya gar du phebs khar lha byang chub 'od la zhal gdams su stsal ba thar 'dod dpa' bo'i snying nor zhes bya ba bzhugs so.\" In zhal gdams phyogs bsgrigs. BDRC W4CZ45286. 1a–4a (pdf pp. 3–10).Version: 1.0-20211001The Sanskrit translates as: May all be auspicious! ↩ If you find this site useful, please consider helping us to achieve our goal of translating more classic works from the Buddhist tradition and making them freely available. Please support us on Patreon.This work is licensed under a Creative Commons Attribution-NonCommercial 4.0 International License. ISSN 2753-4812","metadata":{"source":"https://www.lotsawahouse.org/indian-masters/atisha/heart-treasure-for-warriors","title":"Heart Treasure for the Warriors Who Long for LiberationQuick Links","contentLength":1144}},{"pageContent":"English | Français | བོད་ཡིག Atiśa DīpaṃkaraCourtesy of Himalayan Art ResourcesFew figures in the transmission of the Dharma from India to Tibet hold as central of a role as the great master Atiśa Dīpaṃkara Śrījñāna (982–1055?). Often referred to in Tibetan simply by the epithet of “Lord” (Tib. jo bo rje), Atiśa is the individual most associated with the eleventh-century revival of Buddhism in Tibet, which followed the tumultuous era of fragmentation (sil bu’i dus) that began with the 842 collapse of the Tibetan Empire. His impact on the Tibetan Buddhist Dharma continues to reverberate to this day, nearly a full millennium after he first arrived in the Land of Snows, and his teachings have inspired millions of Buddhists in Central Asia and now the world over. A brief introduction to his life and activities may shed light on this foundational text. Atiśa was born in 982 as the second son of a royal house in Bengal, eastern India. On the eve of an adolescent marriage, he experienced a powerful vision of Tārā that motivated him to renounce the worldly life, even at this young age, and embark on the Buddhist path. He wandered through the jungles and mountains of India seeking the instruction of Buddhist masters, and he is said to have studied under a great number of mahāsiddhas. There are also accounts that he may have practiced the tantric sexual yogas at this time.[1] He received the bodhisattva vows from the master Bodhibhadra at the great Indian monastic university of Nālandā. At twenty-nine, the same age that Siddhartha left the palace, Atiśa had a dream in which he was urged by the Buddha himself to ordain, prompting him to take full monastic vows at a monastery in Bodh Gaya. Upon ordination, he was given the name Dīpaṃkara Śrījñāna, “He Whose Deep Awareness Acts as a Lamp.” With his relatively late ordination and scholarly pursuits, Atiśa’s biography is an inverse of Indian mahāsiddhas such as Nāropa, who only disrobed to practice tantra after many years living as a pure monk and scholar. Atiśa’s full monastic ordination after nearly two decades spent as a wandering yogi demonstrates the tremendous esteem with which he held the Vinaya and monastic discipline, values reflected in the Lamp for the Path and his broader missionary activities in Tibet. Atiśa’s most important teacher is referred to in Tibetan texts as Serlingpa (“The One from the Golden Island, Suvarṇadvīpa”), the Indonesian teacher also known as Suvarṇadvīpa Dharmakīrti. Atiśa heard tell of this great master of bodhicitta and resolved to undertake the perilous ocean journey to meet him and receive his teachings. He spent many tumultuous months at sea, rife with danger and obstacles, before he finally crossed the Strait of Malacca and arrived at the island of Sumatra where he met the sublime master. Atiśa remained on the island for twelve years, training intensively in bodhicitta and mind training (blo sbyong). He then returned to India as a lineage holder of Serlingpa’s precious teachings and later served as the abbot the great monastic university Vikramaśīla. In Tibet, he declared that of his forty-five teachers, Serlingpa was the most important; his numerous biographies report that the mere mention of Serlingpa’s name caused Atiśa’s eyes to brim with tears. The story of Atiśa’s invitation to Tibet is one of the most legendary in the Buddhist history of the country. Toward the end of the tenth century, the king of the Western Tibetan kingdom of Purang-Guge (pu hrangs gu ge), Lha Lama Yeshe Ö, sent twenty-one young Tibetans to Kashmir with the aim of reviving uncorrupted Buddhist teachings in his kingdom. This was prompted by the belief that Buddhism had fallen into a state of intense moral decay with the collapse of the Tibetan empire. Nineteen of the youths perished on the journey, marking the first of many supreme sacrifices required to bring Atiśa’s pure Dharma to Tibet. One of the two young men who survived was the great translator Rinchen Zangpo (958–1055), who informed the king of master Atiśa, whose fame had spread from eastern India all the way to the western mountains of Kashmir. The king sent a mission of nine men with a sizable offering of gold to Vikramaśīla to implore Atiśa to come to Tibet and restore the Buddhadharma. Only one of the nine survived the treacherous journey across the Himalayas and into India, but Atiśa declined the invitation and gold, saying it was important he remain in India. While amassing even more gold with which to invite the master, King Yeshe Ö was captured by the ardently anti-Buddhist Karluk (Qarluq) people, who said that the king’s freedom could only be bought for his own weight in gold. His nephew Jangchub Ö raised the requisite fortune for the king’s release only to have Yeshe Ö tell him to use the gold to again invite Atiśa, now with the message that the king had sacrificed his very life to bring the master to Tibet.[2] When Atiśa heard the story of the king’s supreme sacrifice, and on being urged directly by the goddess Tārā herself, he accepted the invitation and departed for Tibet, where he would remain for the rest of his life. The present text, The Lamp for the Path to Enlightenment, is a masterpiece of Buddhist literature. As noted in the first and final verses, Atiśa composed the treatise at the urging of Jangchub Ö, who became king following his uncle’s death. The text fully integrates the three vehicles of the Buddha’s teachings and shows them to be entirely non-contradictory. Doboom Tulku and Glenn Mullin note that “it is largely due to [Atiśa] that today all Tibetan sects of Buddhism are a combination of Hinayana, general Mahayana and Vajrayana doctrines.”[3] The great nineteenth-century master Dza Patrul Rinpoche wrote that although Atiśa had full mastery over the entire range of Buddhist teachings, sūtra and tantra, the foundational practice of taking refuge was of such paramount importance to him that Tibetans nicknamed him the ‘Refuge Paṇḍita.’[4] Atiśa’s masterwork is the foundational text for the “stages of the path” (lam rim) genre so prominent in Tibetan Buddhist literature. Gampopa’s Jeweled Ornament of Liberation (dam chos yid bzhin nor bu thar pa rin po che’i rgyan), Tsongkhapa’s Great Treatise on the Stages of the Path (lam rim chen mo), and Longchenpa’s Finding Rest in the Nature of Mind (sems nyid ngal gso), seminal classics of the Kagyü, Gelug, and Nyingma schools respectively, all draw their basic framework from Atiśa's Lamp for the Path. Given that this is one of the most foundational texts in Tibetan Buddhism, one which shaped the tradition as we know it today, it is a great honour to present this English translation.[5] May it be of benefit!Apple, James B. Atisa Dipamkara: Illuminator of the Awakened Mind. Boulder, CO: Shambhala Publications, 2019. Doboom Tulku and Glenn H. Mullin. Atisha and Buddhism in Tibet. New Delhi: Tibet House, 1983.Gardner, Alexander. \"Atiśa Dīpaṃkara,\" Treasury of Lives, accessed March 26, 2021, http://treasuryoflives.org/biographies/view/Atisa-Dipamkara/5717.Laird, Thomas. The Story of Tibet: Conversations with the Dalai Lama. “Chapter 5: The Dharma Returns, and Buddhist Orders Are Born, 978-1204.” New York: Grove Press, 2007.The Dalai Lama. Illuminating the Path to Enlightenment. Trans. Geshe Thupten Jinpa. Eds. Rebecca McClen Novick, Thubten Jinpa and Nicolas Ribush. Long Beach, CA: Thubten Dhargye Ling, 2002. Mullin, Glenn H. The Fourteen Dalai Lamas: A Sacred Legacy of Reincarnation. Santa Fe, NM: Clear Light Publishers, 2001: 13. ↩His Holiness the Dalai Lama recounts how, as a child, he saw the headless body of King Yeshe Ö preserved in salt in the Potala. See Laird: 2007: 71. ↩Atisha and Buddhism in Tibet. New Delhi: Tibet House, 1983: 71. ↩rdza dpal sprul rin po che. rdzogs pa chen po klong chen snying thig gi sngon ’gro’i khrid yig kun bzang bla ma’i zhal lung. New Delhi: chos spyod par skrun khang, 2013: 260. ↩The translator was fortunate to receive the oral transmission and instructions on this text during a public teaching given by His Holiness the Dalai Lama in Choglamsar, Ladakh in the summer of 2016. I am grateful to Dr. Jules Levinson, who graciously allowed me to attend his course based largely on this text in winter 2020. While translating, I referred to previous translations by David Choephel, Richard Sherburne and Ruth Sonam. I am grateful for the careful edits and feedback on the translation provided by Lowell Cook and Adam Pearcey. ↩by Atiśa DīpaṃkaraIn the language of India: Bodhipāthapradipaṃ In the language of Tibet: jangchup lam gyi drönma (byang chub lam gyi sgron ma) In the English language: The Lamp for the Path to Enlightenment Homage to the youthful bodhisattva Mañjuśrī! 1. With great reverence, I prostrate to all the Victorious Ones of the three times, to their Dharma, and to the members of the Saṅgha. Urged by my good student Jangchup Ö, I shall elucidate the Lamp for the Path to Enlightenment. 2. Understand there are three types of individuals— lesser, middling, and superior. I shall set out a system of classification in which their respective characteristics are made completely clear. 3. Know that those who, by whatever means, exclusively seek mere mundane pleasures of saṃsāra for their own benefit are inferior individuals. 4. Those who have turned their backs on saṃsāra’s pleasures and refrain from sinful karma, striving merely for pacification for themselves alone— such individuals are said to be middling. 5. Those who truly desire to completely eradicate all the suffering of others through their own personal suffering— such individuals are supreme. 6. For these noble beings who desire supreme enlightenment, I shall explain the perfect methods taught by spiritual teachers. 7. In the presence of paintings, statues, stūpas, and other representations of the perfect Buddha, offer flowers, fragrant incense, and whatever else you can afford. 8. With the sevenfold offering also taught in Samantabhadra’s Aspiration to Good Deeds, and with the thought never to turn back until attaining the essence of complete enlightenment, 9. With fervent faith in the Three Jewels, place one knee on the ground, join the palms together, and first take refuge three times. 10. Then, beginning with a mind of love for all sentient beings, consider all those, without exception, who suffer in the three lower realms from birth, death, and so forth. 11. With the wish to liberate all beings from the suffering of suffering, from suffering and its causes, generate bodhicitta with irreversible resolve. 12. Maitreya has thoroughly explained the qualities of generating such aspirational bodhicitta in the Sūtra of the Arrayed Tree.[1] 13. Having understood the limitless qualities of the mind of complete enlightenment from reading this sūtra or listening to a spiritual teacher, generate this very state of mind again and again. 14. The Sūtra Requested by Vīradatta thoroughly explains its merits. Here, I shall summarize them by citing only three verses: 15. “If the merit of bodhicitta were to take physical form, even the whole of space itself could not contain its vastness. 16. “If a person were to fill with jewels as many buddhafields as there are grains of sands in the Ganges River and offer them to the Protector of the World, 17. “This would be far surpassed by the offering of someone joining their hands together and bowing in their mind to enlightenment, for this is beyond any limit.” 18. You should generate aspirational bodhicitta and constantly increase it through great exertion. You should fully uphold your precepts as instructed so that you may recollect this in other lifetimes as well. 19. Without the actual vow of engaged bodhicitta, your perfect aspiration will not develop further. With the wish to develop perfect enlightenment, make effort to take the vow in full. 20. Only those who continuously maintain one of the seven types of individual liberation vows or other vows will have the fortune for the bodhisattva vow, no one else. 21. According to the Tathāgata’s explanation of the seven classes of vows of individual liberation, glorious pure conduct—celibacy—is said to be supreme. Take, therefore, the vows of full ordination. 22. According to the ritual described in the discipline chapter of The Bodhisattva Levels, you should take the vow from a good, authentically qualified spiritual teacher. 23. Understand that a good spiritual teacher is one skilled in the vow ritual, who lives by the vow and possesses the patience and compassion to bestow it. 24. In case, after searching for someone like this, you are unable to find such a spiritual teacher, I shall explain another ritual with which to properly take the vow. 25. With utmost clarity, I shall write how long ago, when he was Ambarāja, Mañjuśrī generated bodhicitta, as described in The Ornament of Mañjuśrī’s Buddhafield Sūtra. 26. “In the presence of the Protectors, I generate the mind of perfect enlightenment, and I invite all beings as my guests— These I shall liberate from saṃsāra. 27. “From this moment until I achieve supreme enlightenment, I shall have no thoughts of harm, no anger, avarice, or jealousy. 28. “I shall cultivate pure conduct, and abandon sin and craving. With joy for the vows of discipline, I shall train to emulate the Buddhas. 29. “Taking no joy in swiftly attaining enlightenment for myself, I will remain until the very end for the sake of even a single being. 30. “I shall prepare immeasurable, inconceivable realms and will remain in the ten directions for any who call out my name. 31. “Having purified all physical and verbal actions, I shall also purify my mental activities, and will avoid all that is non-virtuous.” 32. Completely pure body, speech, and mind cause you to maintain the actual vow of engaged bodhicitta. By properly practicing the discipline of the three trainings, your reverence for these trainings grows greater. 33. Therefore, by exerting yourself in the bodhisattva vows, bent on pure and perfect enlightenment, the accumulations for complete enlightenment will be fully perfected. 34. All Buddhas say that the cause for completing the accumulations, whose natures are merit and wisdom, is the development of the higher knowledges. 35. Just as a bird with unfledged wings cannot fly through the sky, one who lacks the power of the higher knowledges will be unable to work for beings’ benefit. 36. The merit of a single day and night gained by one with the higher knowledges is not attained within a hundred lifetimes by one who is without them. 37. Those who desire to swiftly complete the accumulations for perfect enlightenment will accomplish the higher knowledges through effort, not through laziness. 38. The higher knowledges will not arise without the accomplishment of śamatha; therefore, strive again and again to accomplish calm abiding. 39. As long as the requisites for śamatha are weak, even if you were to meditate with great effort for thousands of years, still you would not accomplish samādhi. 40. Therefore, maintaining the requisites taught in the Collection of Samādhi Chapter, place your mind on any suitable virtuous object of focus. 41. When the practitioner achieves śamatha, higher knowledges are also attained. But without the practice of the perfection of wisdom, the obscurations will not be eliminated. 42. Therefore, in order to abandon, without exception, all emotional and cognitive obscurations, constantly meditate on the practice of the perfection of wisdom with skillful means. 43. Wisdom without skillful means and skillful means without wisdom are said to be a form of bondage. Therefore, do not relinquish either one. 44. To eliminate doubts concerning what is wisdom and what are skillful means, I shall clarify the correct distinction between skillful means and wisdom. 45. With the exception of the perfection of wisdom, the accumulations of all virtuous actions, such as the perfections of generosity and so forth, are described as skillful means by the Victorious Ones. 46. Whosoever cultivates wisdom through the power of cultivating skillful means will swiftly attain enlightenment— but not through meditation on selflessness alone. 47. What we call ‘wisdom’ is thoroughly explained as an understanding of the emptiness of inherent existence— the realization that the aggregates, elements, and sense sources are unproduced. 48. Logically, something existent cannot be produced, nor can something nonexistent, like a sky-flower. Consequently, as both faults would apply, something which is both could likewise not come into being. 49. An entity is not produced from itself, nor from something else, nor from both, nor without causes. Therefore, it has no inherent nature. 50. Alternatively, when you analyze any phenomenon as to whether it is singular or multiple, no inherent nature is observed. Phenomena are thus determined to have no nature. 51. The reasoning in The Seventy Verses on Emptiness,[2] The Root Verses on the Middle Way,[3] and so forth, explains how it is proven that the nature of all things is emptiness. 52. As this text would become too long, I have not elaborated further here. In order to facilitate your meditation, I will fully explain only the established conclusions. 53. Thus, any meditation on selflessness in which you do not observe the inherent nature of any phenomena, without exception, is, in and of itself, the cultivation of wisdom. 54. Just as wisdom sees no inherent nature in any phenomena whatsoever, let wisdom itself be subject to analysis, and meditate free from conceptuality. 55. The nature of this existence, which arises from conceptuality, is conceptuality. Therefore, to abandon conceptuality in its entirety is supreme nirvāṇa. 56. Accordingly, the Blessed One said, “The great ignorance of conceptuality plunges us into the ocean of saṃsāra. Resting in non-conceptual samādhi, non-conceptuality is as clear as the sky.” 57. Similarly, in The Dhāraṇī of Entering Non-Conceptuality:[4] “If the heirs of the Victorious Ones contemplate, without concepts, this noble Dharma, they will transcend conceptuality, so hard to overcome, and eventually attain the state of non-conceptuality.” 58. After gaining certainty from scriptures and reasoning that all phenomena are unproduced and without inherent nature, meditate without conceptuality. 59. Accordingly, from meditating on suchness, eventually, you will attain heat and other signs; “Supreme Joy” and the other bhūmis will be attained; And Buddhahood, the enlightened state, will not be far away. 60. If you wish to fully perfect the accumulations for enlightenment with ease, through pacifying, enriching, and the other activities accomplished by the mantric powers; 61. through the power of eight great accomplishments; through accomplishing the “fine vase” and others— If you wish to take up the practice of Secret Mantra as taught in the action, conduct, and other tantras, 62. then, in order to receive empowerment from a vajra master, you must please the noble spiritual teacher through veneration, offerings of wealth and the like, and endeavouring to carry out all commands. 63. Through the complete bestowal of the vajra master empowerment by a spiritual master whom you have delighted, you will be completely purified of all sins and gain the fortune of accomplishing the siddhis. 64. As The Great Tantra of the Primordial Buddha emphatically forbids it, those observing celibacy should never receive the secret and wisdom empowerments. 65. If those practicing celibacy and asceticism were to receive those empowerments, they would be obliged to practice what is forbidden, and their vows of austerity would thus deteriorate. 66. This creates a downfall which would defeat those practicing yogic discipline. As they would be certain to fall into the lower realms, they would never gain accomplishment. 67. For those who have received the vajra master empowerment and have knowledge of suchness, there is no fault in receiving or teaching any tantra, performing fire pūjās, offerings, and so forth. 68. At the urging of Jangchub Ö, I, the Elder Dīpaṃkara Śrī, have concisely explained the Path of Enlightenment, as I’ve seen it taught in the sūtras and other Dharma teachings. This concludes The Lamp for the Path to Enlightenment, composed by the great master Dīpaṃkara Śrījñāna. It was translated and finalized by the great Indian abbot himself and the great translator and editor Gewé Lodrö. This teaching was composed in the Toling Temple in Zhang Zhung.| Translated by Patrick Dowd, 2021.Source: a ti sha. \"byang chub lam gyi sgron ma/.\" In bstan 'gyur/ (dpe bsdur ma). Beijing: krung go'i bod rig pa'i dpe skrun khang, 1994–2008. (BDRC W1PD95844) Vol. 64: 1678–1686.Version: 1.4-20220901Skt. Gaṇḍavyūha Sūtra, Tib. sdong po bkod pa’i mdo. ↩Skt. Śūnyatāsaptatikārikā, Tib. stong nyid bdun bcu pa. ↩Skt. Prajñā-nāma-mūlamadhyamakakārikā, Tib. dbu ma rtsa ba shes rab. ↩Skt. Avikalpapraveśadhāraṇī, Tib. rnam par mi rtog par ‘jug pa’i gzungs. ↩ If you find this site useful, please consider helping us to achieve our goal of translating more classic works from the Buddhist tradition and making them freely available. Please support us on Patreon.This work is licensed under a Creative Commons Attribution-NonCommercial 4.0 International License. ISSN 2753-4812","metadata":{"source":"https://www.lotsawahouse.org/indian-masters/atisha/lamp-path-enlightenment","title":"Translator’s IntroductionFurther Reading (in English)The Lamp for the Path to EnlightenmentQuick Links","contentLength":3618}}]